------------------------------------------------------------------------------------------------------
--drop table question_matcher.questions;
create table question_matcher.questions (
                                            id        serial         not null,
                                            question  varchar(1024)  null,
                                            constraint pk_question_matcher_questions primary key (id)
                                        )
;
create index idx_questions_question on question_matcher.questions (question);
------------------------------------------------------------------------------------------------------
insert into question_matcher.questions (question)
values
    ('Як правильно вибрати найбільш відповідний ноутбук для роботи та навчання в інтернет-магазині?'),
    ('Як правильно вибрати найбільш відповідний ноутбук для ігор в інтернет-магазині?'),
    ('Як правильно вибрати найбільш відповідний смартфон?'),
    ('Як оформити замовлення на смартфон у інтернет-магазині та вибрати найкращий спосіб доставки?'),
    ('Яким чином провести оплату онлайн за побутову техніку та перевірити безпеку транзакції?'),
    ('Як відслідковувати статус доставки замовлення техніки через інтернет-магазин?'),
    ('Як зробити замовлення на кухонну техніку та вибрати найбільш ефективний гарантійний план?'),
    ('Де знайти найбільш детальну інформацію про процес оформлення замовлення в інтернет-магазині техніки?'),
    ('Що треба враховувати при виборі способу оплати замовлення техніки онлайн?'),
    ('Як визначити доступність та строк доставки для покупки техніки у інтернет-магазині?'),
    ('Які переваги може надати програма лояльності для клієнтів інтернет-магазину техніки?'),
    ('Кому звертатися в разі питань про гарантійне обслуговування при покупці техніки в інтернет-магазині?');
------------------------------------------------------------------------------------------------------